/*
 * HW_003.c
 *
 * Created: 2024-08-02 오후 12:58:44
 * Author : lordk
 * SRS:
 * 모든 SRS(명세서)는 과제보고서와 작업일지(개인)에 기록함.
 * • 덧셈, 뺄셈, 곱셈, 나눗셈이 가능한 계산기 만들어 값을 LCD에 띄운다. (ex. A + B = C의 형태)
 * ※ ‘A + B = C’ 의 값은 LCD의 1번째 줄에 다 띄울 수 있도록 한다.
 * 1. 첫번째 스위치를 누를 때마다 A의 값이 1씩 오른다. (초기값 A = 1)
 * 2. 두번째 스위치를 누를 때마다 산술 연산자가 바뀐다. (순서는 ‘+’ ‘-‘ ‘*’ ‘/’ 순)
 * 3. 세번째 스위치를 누를 때마다 B의 값이 1씩 오른다. (초기값 B = 1)
 * 4. 네번째 스위치를 누르면 연산을 하여 값을 LCD에 띄운다
 */ 

#include <avr/io.h>

int main(void)
{
	
    while (1) {
		
    }
}

